<a href="https://colab.research.google.com/github/technolearning/MachineLearning/blob/master/Reading_the_data_into_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#importing pandas

import pandas as pd

In [0]:
# reading the csv file

df = pd.read_csv("data.csv")

In [4]:
#seeing the dimension of the file

df.shape

(891, 12)

In [5]:
#seeing the names of varibales in the dataset

df.columns

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [6]:
#seeing the top 5 rows 

df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]